# Дан список чисел. Определите, сколько в нем встречается разных чисел

myList = [1, 1, 2, 0, -1, 3, 4, 4]
print(len(set(myList)))
print(set(myList))

# выведет только уникальные числа