# Функция zip()
# применяется к набору итерируемых объектов и
# возвращает итератор с кортежами из элементов входных данных

# Вывести [('user1', 4), ('user2', 5), ('user3', 9), ('user4', 14), ('user5', 7)]

users = ['user1', 'user2', 'user3', 'user4', 'user5']
ids = [4, 5, 9, 14, 7]
data = list(zip(users, ids))
print(data)