# Задача 2: Найдите сумму цифр трехзначного числа.

a = int(input('Введите число a: '))
b = int(input('Введите число b: '))
c = int(input('Введите число c: '))

res = str(a + b + c)
print('(a + b + c) = ' + res)